tap "alienator88/cask"
tap "buo/cask-upgrade"
tap "candid82/brew"
tap "caskly/tap", "https://github.com/caskly/tap.git"
tap "dail8859/notepadnext"
tap "daniyalmaster693/casks"

tap "domt4/autoupdate"
tap "fastrepl/hyprnote"
tap "felixkratz/formulae"
tap "jpmhouston/bananameterlabs"
tap "kennyparsons/gitbak"
tap "knqyf263/pet"
tap "koekeishiya/formulae"
tap "nikitabobko/tap"
tap "romankurnovskii/cask"

tap "yqrashawn/goku"
tap "zimengxiong/tools"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# General-purpose data compression with high compression ratio
brew "xz"
# Library to render SVG files using Cairo
brew "librsvg"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Print a list of paths as a tree of paths
brew "as-tree"
# Automatically exclude development dependencies from Time Machine backups
brew "asimov"
# Spell checker with better logic than ispell
brew "aspell"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Library for command-line editing
brew "readline"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Command-line interface for SQLite
brew "sqlite"
# Linux/OSX/FreeBSD resource monitor
brew "bpytop"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Emacs dependency management
brew "cask"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Cross-platform make
brew "cmake"
# PDF Command-line Tools
brew "cpdf"
# AV1 decoder targeted to be small and fast
brew "dav1d"
# Secure hashing function
brew "libb2"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Toolkit for creating graphical user interfaces
brew "gtk4"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Duplicate file utility
brew "czkawka"
# Load/unload environment variables based on $PWD
brew "direnv"
# View disk space usage and delete unwanted data, fast
brew "dua-cli"
# Spellchecker wrapping library
brew "enchant"
# Modern, maintained replacement for ls
brew "eza"
# Efficient Duplicate File Finder
brew "fclones"
# Simple, fast and user-friendly alternative to find
brew "fd"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Plugin manager for the Fish shell
brew "fisher"
# Generic library support script
brew "libtool"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Prevents you from committing sensitive information to a git repo
brew "git-secrets"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Improved top (interactive process viewer)
brew "htop"
# Spell checker and morphological analyzer
brew "hunspell"
# Library for reading RAW files from digital photo cameras
brew "libraw"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Lynx-like WWW browser that supports tables, menus, etc.
brew "links"
# Powerful, lightweight programming language
brew "lua"
# Package manager for the Lua programming language
brew "luarocks"
# Keep your Mac's application settings in sync
brew "mackup"
# Swiss Army knife of email handling
brew "mailutils"
# Mac App Store command-line interface
brew "mas"
# Modern and intuitive terminal-based text editor
brew "micro"
# SMTP client that can be used as an SMTP plugin for Mutt
brew "msmtp"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Adds an OCR text layer to scanned PDF files
brew "ocrmypdf"
# Swiss-army knife of markup format conversion
brew "pandoc"
# General-purpose scripting language
brew "php"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Python version management
brew "pyenv"
# Easily download, build, install, upgrade, and uninstall Python packages
brew "python-setuptools"
# Python interface to Tcl/Tk
brew "python-tk@3.13"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Wrapper around ripgrep that adds multiple rich file types
brew "ripgrep-all"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Autoformat shell script source code
brew "shfmt"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# High-performance system programming language
brew "swift"
# Tool Command Language
brew "tcl-tk@8"
# General purpose fuzzy finder TUI
brew "television"
# Enables extra languages support for Tesseract
brew "tesseract-lang"
# Programmatically correct mistyped console commands
brew "thefuck"
# Official tldr client written in Rust
brew "tlrc"
# Upgrade all the things
brew "topgrade"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# File synchronization tool
brew "unison"
# Execute commands when watched files change
brew "watchexec"
# Internet file retriever
brew "wget"
# Generate your Xcode project from a spec file and your folder structure
brew "xcodegen"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# General-purpose lossless data-compression library
brew "zlib"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Real-time type-ahead completion for Zsh
brew "zsh-autocomplete"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# varlock is a tool to load and validate .env files

# A window border system for macOS
brew "felixkratz/formulae/borders"
# Simple command-line snippet manager
brew "knqyf263/pet/pet"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Communications application with voice, video, chat, and web conferencing
cask "8x8-work"
# Configure Gatekeeper, unquarantine and self-sign apps
cask "alienator88-sentinel"
# Network scanner
cask "angry-ip-scanner"
# AI Coding Agent IDE
cask "antigravity"
# Inspect application bundles
cask "apparency"
# Tool for digging into binary files
cask "archaeology"
# Multi-track audio editor and recorder

# File manager
cask "bloom"
# Prevents your sleeping computer from connecting to Bluetooth accessories
cask "bluesnooze"
# Scriptable scratchpad for developers
cask "boop"
# Enter calculations into any Service-aware app

# E-books management software
cask "calibre"
# Fastest file searching tool

# Homebrew cask management and app update tool
cask "caskly@beta"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# OpenAI's official browser with ChatGPT built in

# Anthropic's official Claude AI desktop app
cask "claude"
# Mounts cloud storages as local discs

# Family of tools to build, test and package software
cask "cmake-app"
# Track and budget money

# Customise menu item keyboard shortcuts
cask "customshortcuts"
# JSON Viewer
cask "dadroit-json-viewer"
# Disk space visualiser
cask "daisydisk"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# Tool to enable and disable hidden functions of Finder and other apps
cask "deeper"
# Searching and troubleshooting tool
cask "detectx-swift"
# Assistant for efficient web searches
cask "devonagent"
# Collect, organise, edit and annotate documents
cask "devonthink"
# Scans for dylib hijacking
cask "dhs"
# Window peeking utility app
cask "dockdoor"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Finds duplicate files in a computer system
cask "dupeguru"
# Store securely encrypted backups in the cloud
cask "duplicati"
# Alternative to Apple's DiskImageMounter app
cask "fastdmg"
# Desktop client for Filen.io

# File finder
cask "find-any-file"
# Utility for customizing which browser to start

cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-symbols-only-nerd-font"
# Re-enable the font smoothing controls
cask "fontsmoothingadjuster"
# Terminal emulator that uses platform-native UI and GPU acceleration

# Desktop client for GitHub repositories
cask "github"
# Xcode extension for GitHub Copilot
cask "github-copilot-for-xcode"
# CLI for GitKraken
cask "gitkraken-cli"
# Git client focusing on productivity
cask "gitkraken-on-premise-serverless"
# Utility to provide quick look previews for files that aren't natively supported
cask "glance-chamburr"
# Grammarly for desktop
cask "grammarly-desktop"
# Desktop automation application
cask "hammerspoon"
# Automated organisation
cask "hazel"
# Chromium-based web browser
cask "helium-browser"
# Free and open-source media player
cask "iina"
# Enable generative AI features in iTerm2
cask "itermai"
# Enables an integrated web browser in iTerm2
cask "itermbrowserplugin"
# Automatically ejects external drives
cask "jettison"
# Keyboard customiser
cask "karabiner-elements"
# File archiver
cask "keka"
# Automation software
cask "keyboard-maestro"
# Open-source keystroke visualiser

# Tool to show what is persistently installed on the computer
cask "knockknock"
# Automatically quit apps when their last window is closed
cask "last-window-quits"
# Utility that shows the latest app updates
cask "latest"
# Custom Discord client
cask "legcord"
# Free cross-platform office suite, fresh version
cask "libreoffice"
# Host-based application firewall
cask "little-snitch"
# Discover, download, and run local LLMs

# Clipboard manager
cask "maccy"
# Track and update to the latest versions of installed software
cask "macupdater"
# Operating system maintenance and cleaning utility
cask "maintenance"
# Multi-platform web browser
cask "microsoft-edge"
# Network information and diagnostics utility
cask "neo-network-utility"
# Network monitor
cask "netiquette"
# App to write, plan, collaborate, and get organised
cask "notion"
# Simple application that will prevent iTunes or Apple Music from launching
cask "notunes"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Get up and running with large language models locally
cask "ollama-app"
# Verify system files structure, run miscellaneous maintenance and more
cask "onyx"
# G-code generator for 3D printers
cask "orcaslicer"
# WebKit based web browser

# Utility to uninstall apps and remove leftover files from old/uninstalled apps
cask "pearcleaner"
# Show photos or camera feeds on the desktop
cask "photostickies"
# Tool to create native applications from command-line scripts
cask "platypus"
# Podcast platform
cask "pocket-casts"
# Process monitor
cask "processspy"
# File search app

# Client for Proton Drive
cask "proton-drive"
# Client for Proton Mail and Proton Calendar
cask "proton-mail"
# Bridges Proton Mail to email clients supporting IMAP and SMTP protocols
cask "proton-mail-bridge"
# Quick Look generator for Markdown files

# Thumbnails, static previews, cover art and metadata for video files
cask "qlvideo"
# Better Finder alternative
cask "qspace-pro"
# All-in-one bookmark manager
cask "raindropio"
# Imaging utility to install operating systems to a microSD card

# Control your tools with a few keystrokes
cask "raycast"
# Emoji picker optimised for blind people
cask "rocket"
# Integrated development environment focused entirely on AppleScript
cask "script-debugger"
# Utility to control Gatekeeper via a GUI
cask "sentinel-app"
# Collection of apps available by subscription
cask "setapp"
# Email client
cask "shortwave"
# Instant messaging application focusing on security
cask "signal"
# Automatically checks computer's security
cask "silentknight"
# PDF reader and note-taking application
cask "skim"
# Displays all open files and sockets in use by all running processes
cask "sloth"
# Audio device utility
cask "soundanchor"
# Music streaming service
cask "spotify"
# Customise mouse buttons, wheels and cursor speed
cask "steermouse"
# Search and click text anywhere on screen

# Dictation tool including LLM reformatting
cask "superwhisper"
# VPN client for secure internet access and private browsing
cask "surfshark"
# Application for inspecting installer packages
cask "suspicious-package"
# XMPP client
cask "swift-im"
# Replacement for RCDefaultApps, written in Swift
cask "swiftdefaultappsprefpane"
# Real time file synchronisation software
cask "syncthing-app"
# Quicklook extension for source files
cask "syntax-highlight"
# Task manager for teams

# Tool to explore all the running tasks (processes)
cask "taskexplorer"
# Desktop client for Telegram messenger
cask "telegram-desktop"
# Web browser
cask "thebrowsercompany-dia"
# Instant fuzzy finder for files including system and hidden files
cask "thelowtechguys-cling"
# Time Machine log viewer & status inspector
cask "thetimemachinemechanic"
# Finder thumbnail provider for some .gcode, .bgcode and .3mf files
cask "thumbhost3mf"
# Batch image thumbnail generation utility
cask "thumbsup"
# To-do list
cask "todoist-app"
# Batch rename utility
cask "transnomino"
# Companion app for the Trezor hardware wallet
cask "trezor-suite"
# Tool to automate the insertion of frequently used text and graphics
cask "typinator"
# All in one app update tool for macOS including Homebrew cask management

# Multimedia player
cask "vlc"
# Voice to text app
cask "voiceink"
# Rust-based terminal
cask "warp"
# GPU-accelerated cross-platform terminal emulator and multiplexer

# Native desktop client for WhatsApp
cask "whatsapp"
# Network protocol analyzer
cask "wireshark-app"
# Tool that provides commands for working with selected text

# Open-source version of the X.Org X Window System
cask "xquartz"
# Multiplayer code editor
cask "zed"
mas "1Password for Safari", id: 1569813296
mas "AutoPause", id: 6747332615
mas "Barbee", id: 0
mas "Capture", id: 6458535284
mas "Clean Links", id: 6747395062
mas "CloudMounter", id: 1130254674
mas "ctrlv", id: 6749192257
mas "Cyclework", id: 6754218094
mas "Developer", id: 640199958
mas "DevHub", id: 6476452351
mas "DS Store Cleaner", id: 6741675455
mas "Flyleaf", id: 6475200381
mas "Folder Preview", id: 6698876601
mas "Grammarly for Safari", id: 1462114288
mas "Grila", id: 6444335028
mas "Hush", id: 1544743900
mas "Hyperduck", id: 6444667067
mas "JuxtaText", id: 6504801865
mas "Kagi for Safari", id: 1622835804
mas "Kindle", id: 302584613
mas "Markdown Preview", id: 6739955340
mas "Microsoft Excel", id: 462058435
mas "Microsoft OneNote", id: 784801555
mas "Microsoft Outlook", id: 985367838
mas "Microsoft Word", id: 462054704
mas "NextDNS", id: 1464122853
mas "NoNoise", id: 6755174608
mas "Nuit", id: 6755113041
mas "Numbers", id: 409203825
mas "Obsidian Web Clipper", id: 6720708363
mas "OneDrive", id: 823766827
mas "Pages", id: 409201541
mas "Parachute", id: 6748614170
mas "Parcel Classic", id: 639968404
mas "Pasteboard Viewer", id: 1499215709
mas "PDFoo", id: 540272061
mas "PDFOutliner", id: 420874236
mas "Perplexity", id: 6714467650
mas "PiPad", id: 1482575592
mas "PreviewText", id: 1660037028
mas "Raycast Companion", id: 6738274497
mas "Russet", id: 6754737926
mas "Sandkorn", id: 1377973524
mas "Save to Raindrop.io", id: 1549370672
mas "Save to Reader", id: 1640236961
mas "Shareful", id: 1522267256
mas "SimpleLogin for Safari", id: 6475835429
mas "SnippetsLab", id: 1006087419
mas "Spokenly", id: 6740315592
mas "Startup Manager", id: 1296723195
mas "Stickier", id: 6447073047
mas "Super Agent", id: 1568262835
mas "TestFlight", id: 899247664
mas "Text Toolset", id: 1157225201
mas "TextMine/ Text to Data", id: 0
mas "TextPlus", id: 1234445803
mas "Trackless Links Pro", id: 6754613166
mas "uBlock Origin Lite", id: 6745342698
mas "Userscripts", id: 1463298887
mas "WakeMinder", id: 6744974871
mas "Wayback Machine", id: 1472432422
mas "Xcode", id: 497799835
mas "XSpeak", id: 6748146688
mas "YABA", id: 6747272081
vscode "actboy168.extension-path"
vscode "alefragnani.project-manager"
vscode "anthropic.claude-code"
vscode "bladnman.auto-align"
vscode "carlocardella.vscode-texttoolbox"
vscode "charliermarsh.ruff"
vscode "chouzz.vscode-better-align"
vscode "christian-kohler.npm-intellisense"
vscode "cppcxy.emmylua-codestyle"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "google.geminicodeassist"
vscode "idleberg.applescript"
vscode "ionutvmi.path-autocomplete"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.cpptools-themes"
vscode "openai.chatgpt"
vscode "qcz.text-power-tools"
vscode "shakram02.bash-beautify"
vscode "sumneko.lua"
vscode "swiftlang.swift-vscode"
vscode "tamasfe.even-better-toml"
vscode "upstash.context7-mcp"
vscode "vadimcn.vscode-lldb"
vscode "varlock.env-spec-language"
vscode "virgilsisoe.hammerspoon"
vscode "virgilsisoe.hammerspoon-snippets"
vscode "zainchen.json"
go "github.com/sammcj/gollama"
