1password
1password-cli
8x8-work
alienator88-sentinel
angry-ip-scanner
antigravity
apparency
archaeology
bike
bloom
bluesnooze
boop
calcservice
calibre
cardinal-search
caskly@beta
chatgpt
claude
cloudmounter
cmake-app
copilot-money
customshortcuts
dadroit-json-viewer
daisydisk
db-browser-for-sqlite
deeper
detectx-swift
devonagent
devonthink
dhs
dockdoor
docker-desktop
downie
dupeguru
duplicati
fastdmg
find-any-file
font-fira-code-nerd-font
font-hack-nerd-font
font-jetbrains-mono-nerd-font
font-meslo-lg-nerd-font
font-symbols-only-nerd-font
fontsmoothingadjuster
ghostty
github
github-copilot-for-xcode
gitkraken-cli
gitkraken-on-premise-serverless
glance-chamburr
grammarly-desktop
hammerspoon
hazel
helium-browser
iina
itermai
itermbrowserplugin
jettison
karabiner-elements
keka
keyboard-maestro
keycastr
knockknock
last-window-quits
latest
legcord
libreoffice
little-snitch
lm-studio
maccy
macupdater
maintenance
microsoft-edge
neo-network-utility
netiquette
notion
notunes
obsidian
ollama-app
onyx
orcaslicer
orion
osaurus
pearcleaner
photostickies
pingbar
platypus
pocket-casts
processspy
profind
proton-drive
proton-mail
proton-mail-bridge
qlmarkdown
qlvideo
qspace-pro
raindropio
raycast
rectangle-pro
rocket
rust-disk-cleaner
script-debugger
sentinel-app
setapp
shortwave
signal
silentknight
skim
sloth
soundanchor
spotify
steermouse
superwhisper
surfshark
suspicious-package
swift
swift-im
swiftdefaultappsprefpane
syncthing-app
syntax-highlight
taskade
taskexplorer
telegram-desktop
thebrowsercompany-dia
thelowtechguys-cling
thetimemachinemechanic
thumbhost3mf
thumbsup
todoist-app
transnomino
trezor-suite
typinator
updatest@beta
vlc
voiceink
warp
whatsapp
wireshark-app
wordservice
xquartz
zed
