as-tree
asimov
automake
bat
bpytop
cask
chezmoi
cmake
cpdf
czkawka
direnv
djvulibre
dotenvx/brew/dotenvx
dua-cli
duckdb
enchant
eza
fclones
fd
felixkratz/formulae/borders
fisher
gh
git-delta
git-secrets
gradle
htop
hunspell
imagemagick
jpeg
jq
knqyf263/pet/pet
lazygit
links
luarocks
mackup
mailutils
mas
micro
msmtp
neovim
node
ocrmypdf
pandoc
php
pinentry-mac
pipx
poppler
pyenv
python-setuptools
python-tk@3.13
qalculate-qt
rich-cli
ripgrep-all
sevenzip
shfmt
speedtest-cli
stow
swift
tcl-tk@8
television
tesseract-lang
thefuck
tlrc
topgrade
tree
unison
watchexec
wget
xcodegen
yazi
zig
zlib
zoxide
zsh
zsh-autocomplete
zsh-autosuggestions
